In [1]:
import pandas as pd
import numpy as np

#data preprocessing libraries

from sklearn.preprocessing import LabelEncoder

#data train,test libraries

from sklearn.model_selection import train_test_split

#Machine learning Algorithm

from sklearn.linear_model import LogisticRegression

#Model Evaluation Libraries

from sklearn.metrics import accuracy_score

In [2]:
df=pd.read_excel("ktmdata.xlsx")

In [3]:
df.head()

,ID,Age,Gender,Occupation,Phone Type,Current Bike,Relationship,Response
0,1,53,Male,Professional,Average,180 to 220,Complicated,Not purchased
1,2,27,Female,Self Employed,Low End,No Bike,Single,Purchased
2,3,39,Female,Unemployed,Average,180 to 220,Married,Not purchased
3,4,20,Female,Unemployed,High End,No Bike,Married,Not purchased
4,5,29,Male,Student,Average,180 to 220,Complicated,Purchased

In [4]:
le = LabelEncoder()

In [5]:
df["Gender"]=le.fit_transform(df["Gender"])

In [6]:
df["Occupation"]=le.fit_transform(df["Occupation"])

In [7]:
df["Phone Type"]=le.fit_transform(df["Phone Type"])

In [8]:
df["Current Bike"]=le.fit_transform(df["Current Bike"])

In [9]:
df["Relationship"]=le.fit_transform(df["Relationship"])

In [10]:
df["Response"]=le.fit_transform(df["Response"])

In [11]:
df.head()

,ID,Age,Gender,Occupation,Phone Type,Current Bike,Relationship,Response
0,1,53,1,0,0,1,1,0
1,2,27,0,1,2,4,3,1
2,3,39,0,3,0,1,2,0
3,4,20,0,3,1,4,2,0
4,5,29,1,2,0,1,1,1

In [12]:
df.isnull().sum()

ID              0
Age             0
Gender          0
Occupation      0
Phone Type      0
Current Bike    0
Relationship    0
Response        0
dtype: int64

In [13]:
df.isna().sum()

ID              0
Age             0
Gender          0
Occupation      0
Phone Type      0
Current Bike    0
Relationship    0
Response        0
dtype: int64

In [14]:
x=df.drop("Response",axis=1)

In [15]:
x.head()

   ID  Age  Gender  Occupation  Phone Type  Current Bike  Relationship
0   1   53       1           0           0             1             1
1   2   27       0           1           2             4             3
2   3   39       0           3           0             1             2
3   4   20       0           3           1             4             2
4   5   29       1           2           0             1             1

In [16]:
y=df[["Response"]]

In [17]:
y

      Response
0            0
1            1
2            0
3            0
4            1
...        ...
1513         1
1514         1
1515         1
1516         1
1517         1

[1518 rows x 1 columns]

In [18]:
x_train,x_test,y_train,y_test=train_test_split(x,y,test_size=0.3,random_state=50)

In [19]:
lr_model = LogisticRegression()

In [20]:
lr_model

LogisticRegression()

In [21]:
lr_model.fit(x_train,y_train)

C:\Users\shubh\anaconda3\lib\site-packages\sklearn\utils\validation.py:63: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples, ), for example using ravel().
  return f(*args, **kwargs)
C:\Users\shubh\anaconda3\lib\site-packages\sklearn\linear_model\_logistic.py:763: ConvergenceWarning: lbfgs failed to converge (status=1):
STOP: TOTAL NO. of ITERATIONS REACHED LIMIT.

Increase the number of iterations (max_iter) or scale the data as shown in:
    https://scikit-learn.org/stable/modules/preprocessing.html
Please also refer to the documentation for alternative solver options:
    https://scikit-learn.org/stable/modules/linear_model.html#logistic-regression
  n_iter_i = _check_optimize_result(

LogisticRegression()

In [22]:
model_pred=lr_model.predict(x_test)

In [23]:
accuracy_score(y_test,model_pred)

0.7741228070175439

In [24]:
model_pred1=lr_model.predict(x_train)

In [25]:
accuracy_score(y_train,model_pred1)

0.7467043314500942